#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
神™的repr，还是不要乱用比较好，
看起来好像是，
每个 \ 改成 \\ ,
有 " 就用 ' 包围，' 改成 \'
有 ' 就用 " 包围，
用 ' 包围，
总之处理后的刚好可以给eval转回来，完美的字符串，
"""
assert repr('a') == "'a'"
assert repr(repr('a')) == '"\'a\'"'
assert repr(repr(repr('a'))) == '\'"\\\'a\\\'"\''
assert repr(repr(repr(repr('a')))) == '\'\\\'"\\\\\\\'a\\\\\\\'"\\\'\''
assert repr(repr(repr(repr(repr('a'))))) == '\'\\\'\\\\\\\'"\\\\\\\\\\\\\\\'a\\\\\\\\\\\\\\\'"\\\\\\\'\\\'\''
assert repr(repr(repr(repr(repr(repr('a')))))) == '\'\\\'\\\\\\\'\\\\\\\\\\\\\\\'"\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'a\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'"\\\\\\\\\\\\\\\'\\\\\\\'\\\'\''
assert eval("repr(repr(repr(repr(repr(repr(repr('a')))))))") == '\'\\\'\\\\\\\'\\\\\\\\\\\\\\\'\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'"\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'a\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'"\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'\\\\\\\\\\\\\\\'\\\\\\\'\\\'\''
assert eval(repr(repr(repr(repr(repr(repr(repr('a')))))))) == '\'\\\'\\\\\\\'\\\\\\\\\\\\\\\'"\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'a\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'"\\\\\\\\\\\\\\\'\\\\\\\'\\\'\''
assert eval(eval(eval(eval(eval(repr(repr(repr(repr(repr('a')))))))))) == 'a'
a = repr(repr(repr(repr('a'))))
b = repr(repr(repr(repr('b'))))
assert repr((a,b)) == '({0}, {1})'.format(repr(a), repr(b))

